# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\jrdia\OneDrive\Sync\Documents\GitHub\PSoC-Composite-Decoder\Composite_Decoder.cydsn\Composite_Decoder.cyprj
# Date: Fri, 22 Sep 2017 03:22:12 GMT
#set_units -time ns
create_clock -name {PIXEL_CLK(routed)} -period 162.60162601626016 -waveform {0 81.3008130081301} [list [get_pins {ClockBlock/dclk_0}]]
create_clock -name {Clock(routed)} -period 65.040650406504071 -waveform {0 32.520325203252} [list [get_pins {ClockBlock/dclk_1}]]
create_clock -name {CyILO} -period 1000000 -waveform {0 500000} [list [get_pins {ClockBlock/ilo}] [get_pins {ClockBlock/clk_100k}] [get_pins {ClockBlock/clk_1k}] [get_pins {ClockBlock/clk_32k}]]
create_clock -name {CyIMO} -period 333.33333333333331 -waveform {0 166.666666666667} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyPLL_OUT} -period 16.260162601626018 -waveform {0 8.13008130081301} [list [get_pins {ClockBlock/pllout}]]
create_clock -name {CyMASTER_CLK} -period 16.260162601626018 -waveform {0 8.13008130081301} [list [get_pins {ClockBlock/clk_sync}]]
create_generated_clock -name {CyBUS_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/clk_bus_glb}]]
create_generated_clock -name {PIXEL_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 11 19} -nominal_period 162.60162601626016 [list [get_pins {ClockBlock/dclk_glb_0}]]
create_generated_clock -name {Clock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 5 9} [list [get_pins {ClockBlock/dclk_glb_1}]]
create_generated_clock -name {timer_clock_2} -source [get_pins {ClockBlock/clk_sync}] -edges {1 7 13} -nominal_period 97.5609756097561 [list [get_pins {ClockBlock/dclk_glb_2}]]
create_generated_clock -name {CLK_3} -source [get_pins {ClockBlock/clk_sync}] -edges {1 63 123} -nominal_period 1008.130081300813 [list [get_pins {ClockBlock/dclk_glb_3}]]
create_generated_clock -name {UART_1_IntClock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 133 265} -nominal_period 2162.60162601626 [list [get_pins {ClockBlock/dclk_glb_4}]]
create_generated_clock -name {Clock_2} -source [get_pins {ClockBlock/clk_sync}] -edges {1 61501 122999} -nominal_period 1000000 [list [get_pins {ClockBlock/dclk_glb_5}]]

set_false_path -from [get_pins {__ONE__/q}]

# Component constraints for C:\Users\jrdia\OneDrive\Sync\Documents\GitHub\PSoC-Composite-Decoder\Composite_Decoder.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\jrdia\OneDrive\Sync\Documents\GitHub\PSoC-Composite-Decoder\Composite_Decoder.cydsn\Composite_Decoder.cyprj
# Date: Fri, 22 Sep 2017 03:21:53 GMT
